Dachtire/fercus/firmware/dongle/ch32v20x/User/app.c
/********************************** (C) COPYRIGHT *******************************
 * File Name          : usbd_composite_km.c
 * Author             : WCH
 * Version            : V1.0.0
 * Date               : 2022/08/20
 * Description        : USB keyboard and mouse processing.
 * Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
 * SPDX-License-Identifier: Apache-2.0
 *******************************************************************************/


/*******************************************************************************/
/* Header Files */
#include "app.h"
#include "ch32v20x_usbfs_device.h"

/*******************************************************************************/
/* Variable Definition */

/* Mouse */
//volatile uint8_t  MS_Scan_Done = 0x00;                                          // Mouse Movement Scan Done
//volatile uint16_t MS_Scan_Result = 0x00F0;                                      // Mouse Movement Scan Result
//uint8_t  MS_Data_Pack[ DEF_ENDP_SIZE_MS ] = { 0x00 };                           // Mouse IN Data Packet

/* Keyboard */
//volatile uint8_t  KB_Scan_Done = 0x00;                                          // Keyboard Keys Scan Done
//volatile uint16_t KB_Scan_Result = 0xF000;                                      // Keyboard Keys Current Scan Result
//volatile uint16_t KB_Scan_Last_Result = 0xF000;                                 // Keyboard Keys Last Scan Result
//uint8_t  KB_Data_Pack[ DEF_ENDP_SIZE_KB ] = { 0x00 };                           // Keyboard IN Data Packet
//volatile uint8_t  KB_LED_Last_Status = 0x00;                                    // Keyboard LED Last Result
//volatile uint8_t  KB_LED_Cur_Status = 0x00;                                     // Keyboard LED Current Result

/* USART */
//volatile uint8_t  USART_Recv_Dat = 0x00;
//volatile uint8_t  USART_Send_Flag = 0x00;
//volatile uint8_t  USART_Send_Cnt = 0x00;

//void kb_col_gpio_init() {
//    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
//    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
//
//    GPIO_InitTypeDef GPIO_InitStructure;
//    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
//    for (int i = 0; i < KB_COL_NUM; ++i) {
//        GPIO_InitStructure.GPIO_Pin   = KB_COL_GPIO_PIN[i];
//        GPIO_Init(KB_COL_GPIO_PORT[i], &GPIO_InitStructure);
//        GPIO_ResetBits(KB_COL_GPIO_PORT[i],KB_COL_GPIO_PIN[i]);
//    }
//}

//void kb_row_gpio_init() {
//    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
//
//    GPIO_InitTypeDef GPIO_InitStructure;
//    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//    switch (kb_device) {
//        default:
//        case KB_DEVICE_KEYBORAD:
//            GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
//            break;
//
//        case KB_DEVICE_VENDOR:
//        case KB_DEVICE_KEYBOARD_ADC_DIFF:
//        case KB_DEVICE_KEYBOARD_ADC_TRIGGER:
//        case KB_DEVICE_CNTLR_ADC:
//            GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AIN;
//            break;
//    }
//
//    for (int i = 0; i < KB_ROW_NUM; ++i) {
//        GPIO_InitStructure.GPIO_Pin = KB_ROW_GPIO_PIN[i];
//        GPIO_Init(KB_ROW_GPIO_PORT, &GPIO_InitStructure);
//    }
//}

//void kb_fn_gpio_init() {
//    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
//    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
//
//    GPIO_InitTypeDef GPIO_InitStructure;
//    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
//
//    for (int i = 0; i < KB_FN_NUM - 1; ++i) {
//        GPIO_InitStructure.GPIO_Pin = KB_FN_GPIO_PIN[i];
//        GPIO_Init(KB_FN_GPIO_PORT[i], &GPIO_InitStructure);
//    }
//
//    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
//    GPIO_PinRemapConfig(GPIO_Remap_SWJ_Disable, ENABLE);
//    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
//    GPIO_InitStructure.GPIO_Pin = KB_FN_3_GPIO_PIN;
//    GPIO_Init(KB_FN_3_GPIO_PORT, &GPIO_InitStructure);
//}

//void cntlr_gpio_init(){
//    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
//
//    GPIO_InitTypeDef GPIO_InitStructure;
//    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
////    js axis
//    for (int i = 0; i < JS_AXIS_NUM; ++i) {
//        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
//        GPIO_InitStructure.GPIO_Pin = JS_AXIS_GPIO_PIN[i];
//        GPIO_Init(JS_AXIS_GPIO_PORT[i], &GPIO_InitStructure);
//    }
////    js switch
//    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
//    GPIO_InitStructure.GPIO_Pin = JS_SW_GPIO_PIN;
//    GPIO_Init(JS_SW_GPIO_PORT, &GPIO_InitStructure);
//}

//void eta_gpio_init(){
//    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
//    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
//    GPIO_PinRemapConfig(GPIO_Remap_SWJ_Disable, ENABLE);
//
//    GPIO_InitTypeDef GPIO_InitStructure;
//    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
//    GPIO_InitStructure.GPIO_Pin = ETA_DISCHRG_PIN;
//    GPIO_Init(ETA_DISCHRG_PORT, &GPIO_InitStructure);
//}

//void eta_bat_gpio_init() {
//    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
//
//    GPIO_InitTypeDef GPIO_InitStructure;
//    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AIN;
//    GPIO_InitStructure.GPIO_Pin = ETA_BAT_PIN;
//    GPIO_Init(ETA_BAT_PORT, &GPIO_InitStructure);
//}

//void led_gpio_init(){
//    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
//
//    GPIO_InitTypeDef GPIO_InitStructure;
//    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
//    GPIO_InitStructure.GPIO_Pin = LED_B_PIN;
//    GPIO_Init(LED_B_PORT, &GPIO_InitStructure);
//    GPIO_SetBits(LED_B_PORT, LED_B_PIN);
//
//    GPIO_InitStructure.GPIO_Pin = LED_G_PIN;
//    GPIO_Init(LED_G_PORT, &GPIO_InitStructure);
//    GPIO_SetBits(LED_G_PORT, LED_G_PIN);
//
//    GPIO_InitStructure.GPIO_Pin = LED_R_PIN;
//    GPIO_Init(LED_R_PORT, &GPIO_InitStructure);
//    GPIO_SetBits(LED_R_PORT, LED_R_PIN);
//
//}

//void led_ctl(uint8_t color, uint8_t status){
//    if (status == TRUE) {
//        switch (color) {
//            default:
//                break;
//            case 0:
//                GPIO_ResetBits(LED_R_PORT,LED_R_PIN);
//                break;
//            case 1:
//                GPIO_ResetBits(LED_G_PORT,LED_G_PIN);
//                break;
//            case 2:
//                GPIO_ResetBits(LED_B_PORT,LED_B_PIN);
//                break;
//        }
//    } else {
//        switch (color) {
//            default:
//                break;
//            case 0:
//                GPIO_SetBits(LED_R_PORT,LED_R_PIN);
//                break;
//            case 1:
//                GPIO_SetBits(LED_G_PORT,LED_G_PIN);
//                break;
//            case 2:
//                GPIO_SetBits(LED_B_PORT,LED_B_PIN);
//                break;
//        }
//    }
//}

//void adc_config() {
//    switch (kb_device) {
//        default:
//        case KB_DEVICE_KEYBORAD:
////        case KB_DEVICE_COMPOSITE:
//            DMA_Tx_Init(DMA1_Channel1, (u32)&ADC1->RDATAR, (u32)js_axis_adc, JS_NUM);
//            DMA_Cmd(DMA1_Channel1, ENABLE);
//
//            ADC_Function_Init();
//            // t = 1 / 12Mhz
//            // longest 71Cycles5 = 7 * 6 us
//            #if KB_SIDE == KB_SIDE_LEFT
//                ADC_RegularChannelConfig(ADC1, ADC_Channel_6, 1, ADC_SampleTime_71Cycles5);
//                ADC_RegularChannelConfig(ADC1, ADC_Channel_7, 2, ADC_SampleTime_71Cycles5);
//            #else
//                ADC_RegularChannelConfig(ADC1, ADC_Channel_8, 1, ADC_SampleTime_71Cycles5);
//                ADC_RegularChannelConfig(ADC1, ADC_Channel_9, 2, ADC_SampleTime_71Cycles5);
//            #endif
//            ADC_SoftwareStartConvCmd(ADC1, ENABLE);
//            break;
//
//        case KB_DEVICE_KEYBOARD_ADC_DIFF:
//        case KB_DEVICE_KEYBOARD_ADC_TRIGGER:
//        case KB_DEVICE_CNTLR_ADC:
//            DMA_Tx_Init(DMA1_Channel1, (u32)&ADC1->RDATAR, (u32)kb_row_adc, KB_ROW_NUM);
//            DMA_Cmd(DMA1_Channel1, ENABLE);
//
//            ADC_Function_Init();
//            // t = 1 / 12Mhz
//            // 71Cycles5 = 7 * 6 us
//            // 2)单次扫描模式转换  // , 3)单次间断模式转换, 4)连续转换
//            ADC_RegularChannelConfig(ADC1, ADC_Channel_0, 1, ADC_SampleTime_71Cycles5);
//            ADC_RegularChannelConfig(ADC1, ADC_Channel_1, 2, ADC_SampleTime_71Cycles5);
//            ADC_RegularChannelConfig(ADC1, ADC_Channel_2, 3, ADC_SampleTime_71Cycles5);
//            ADC_RegularChannelConfig(ADC1, ADC_Channel_3, 4, ADC_SampleTime_71Cycles5);
//            ADC_RegularChannelConfig(ADC1, ADC_Channel_4, 5, ADC_SampleTime_71Cycles5);
//            ADC_RegularChannelConfig(ADC1, ADC_Channel_5, 6, ADC_SampleTime_71Cycles5);
//
//            ADC_SoftwareStartConvCmd(ADC1, ENABLE);
//            break;
//
//        case KB_DEVICE_VENDOR:
//            DMA_Tx_Init(DMA1_Channel1, (u32)&ADC1->RDATAR, (u32)kb_adc_value, KB_ADC_SIZE);
//            DMA_Cmd(DMA1_Channel1, ENABLE);
//
//            ADC_Function_Init();
//            ADC_RegularChannelConfig(ADC1, 0, 1, ADC_SampleTime_1Cycles5);
//            ADC_SoftwareStartConvCmd(ADC1, ENABLE);
//            break;
//    }
//}

//void USART1_Init(u32 baudrate)
//{
//    //	GPIO_InitTypeDef GPIO_InitStructure;
//    USART_InitTypeDef USART_InitStructure;
//
//    /* USART1 GPIO Init */
//    //	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
//    //    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//    //    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
//    //    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_10;
//    //    GPIO_Init(GPIOA, &GPIO_InitStructure);
//    //
//    //    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
//    //    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
//    //    GPIO_Init(GPIOA, &GPIO_InitStructure);
//
//    /* USART1 Init */
//    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
//    USART_InitStructure.USART_BaudRate = baudrate;
//    USART_InitStructure.USART_WordLength = USART_WordLength_8b;
//    USART_InitStructure.USART_StopBits = USART_StopBits_1;
//    USART_InitStructure.USART_Parity = USART_Parity_No;
//    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
//    USART_InitStructure.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
//    USART_Init(USART1, &USART_InitStructure);
//    USART_Cmd(USART1, ENABLE);
//    USART_ClearFlag(USART1,USART_IT_RXNE);
//}

//void TIM1_Init(uint32_t ms)
//{
//    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
////    NVIC_EnableIRQ(TIM1_UP_IRQn);
//
//    NVIC_InitTypeDef NVIC_InitStructure = { 0 };
//    NVIC_InitStructure.NVIC_IRQChannel = TIM1_UP_IRQn;
//    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
//    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
//    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
//    NVIC_Init( &NVIC_InitStructure );
//
//    SetVTFIRQ((u32)TIM1_UP_IRQHandler,TIM1_UP_IRQn,0,ENABLE);
//
//    RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1, ENABLE );
//
//    TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure={0};
//    TIM_TimeBaseInitStructure.TIM_Prescaler = 144 / 2 - 1;
////            TIM_TimeBaseInitStructure.TIM_Period = 2 * 1000 / 8 - 1;
////            TIM_TimeBaseInitStructure.TIM_Period = 2 * 1000 / 25 - 1;  // test ok
////            TIM_TimeBaseInitStructure.TIM_Period = 2 * 1000 / 40 - 1;  // 25 us ok
////            TIM_TimeBaseInitStructure.TIM_Period = 2 * 1000 / 50 - 1;  // 20 us, ok
////            TIM_TimeBaseInitStructure.TIM_Period = 2 * 15 - 1;  // 15 us, no
////            TIM_TimeBaseInitStructure.TIM_Period = 2 * 1000 / 200 - 1;  // 5 us
//    TIM_TimeBaseInitStructure.TIM_Period = 2 * 1000 * ms - 1;  // 1 ms
//    TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
//    TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
//    TIM_TimeBaseInit(TIM1, &TIM_TimeBaseInitStructure);
//
//    TIM_ITConfig(TIM1, TIM_IT_Update, ENABLE);
//    TIM_Cmd( TIM1, ENABLE );
//}

//u16 TxBuf[1024];
//s16 Calibrattion_Val = 0;

/*********************************************************************
 * @fn      DMA_Tx_Init
 *
 * @brief   Initializes the DMAy Channelx configuration.
 *
 * @param   DMA_CHx - x can be 1 to 7.
 *          ppadr - Peripheral base address.
 *          memadr - Memory base address.
 *          bufsize - DMA channel buffer size.
 *
 * @return  none
 */
//void DMA_Tx_Init(DMA_Channel_TypeDef *DMA_CHx, u32 ppadr, u32 memadr, u16 bufsize)
//{
//    DMA_InitTypeDef DMA_InitStructure = {0};
//
//    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
//
//    DMA_DeInit(DMA_CHx);
//    DMA_InitStructure.DMA_PeripheralBaseAddr = ppadr;
//    DMA_InitStructure.DMA_MemoryBaseAddr = memadr;
//    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
//    DMA_InitStructure.DMA_BufferSize = bufsize;
//    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
//    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
//    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
//    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
//    DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
//    DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
//    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
//    DMA_Init(DMA_CHx, &DMA_InitStructure);
//}

//void ADC_Function_Init(void)
//{
//    ADC_InitTypeDef  ADC_InitStructure = {0};
//
//    RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
//    RCC_ADCCLKConfig(RCC_PCLK2_Div6);
//
//    ADC_DeInit(ADC1);
//    ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
//    ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
//    ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
//
//    switch (kb_device) {
//        default:
//        case KB_DEVICE_KEYBOARD_ADC_DIFF:
//        case KB_DEVICE_KEYBOARD_ADC_TRIGGER:
//        case KB_DEVICE_CNTLR_ADC:
////            ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
//            ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
//            ADC_InitStructure.ADC_ScanConvMode = ENABLE;
//            ADC_InitStructure.ADC_NbrOfChannel = KB_ROW_NUM;
//            break;
//
////        case KB_DEVICE_COMPOSITE:
//        case KB_DEVICE_KEYBORAD:
//            ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
//            ADC_InitStructure.ADC_ScanConvMode = ENABLE;
//            ADC_InitStructure.ADC_NbrOfChannel = JS_NUM;
//            break ;
//
//        case KB_DEVICE_VENDOR:
//            ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
//            ADC_InitStructure.ADC_ScanConvMode = DISABLE;
//            ADC_InitStructure.ADC_NbrOfChannel = 1;
//            break;
//    }
//
//    ADC_Init(ADC1, &ADC_InitStructure);
//
//    ADC_DMACmd(ADC1, ENABLE);
//    ADC_Cmd(ADC1, ENABLE);
//
//    ADC_BufferCmd(ADC1, DISABLE); //disable buffer
//    ADC_ResetCalibration(ADC1);
//    while(ADC_GetResetCalibrationStatus(ADC1));
//    ADC_StartCalibration(ADC1);
//    while(ADC_GetCalibrationStatus(ADC1));
//    Calibrattion_Val = Get_CalibrationValue(ADC1);
//
//    ADC_BufferCmd(ADC1, ENABLE); //enable buffer
//}

